package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

import javax.swing.*;

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код

        String name = JOptionPane.showInputDialog("dfsfg");

        for (int i = 0; i < 10; i++)
        {
            //System.out.println("Я не хочу изучать Java, я хочу большую зарплату");


        }
    }
}
